e76nystrom/USBx/project/stm32Info.c
#define __STM32INFO__
#include <stdio.h>

#if defined(STM32F1)
#include "stm32f1xx_hal.h"
#endif
#if defined(STM32F3)
#include "stm32f3xx_hal.h"
#endif
#if defined(STM32F4)
#include "stm32f4xx_hal.h"
#endif
#if defined(STM32F7)
#include "stm32f7xx_hal.h"
#endif
#if defined(STM32H7)
#include "stm32h7xx_hal.h"
#include "core_cm7.h"
#include "stm32h743xx.h"
#endif

#include "include/stm32Info.h"

#if defined(ARDUINO_ARCH_STM32)
#include "monitorSTM32.h"
#define flushBuf flush
#define newline newLine
#else
//#include "config.h"
#include "include/serialio.h"
#define getNum getnum
#endif	/* ARDUINO_ARCH_AVR */

#if  defined(__STM32INFO_INC__)	// <-

typedef struct
{
 union
 {
  struct
  {
   char port;
   char num;
  };
  struct
  {
   uint16_t pinName;
  };
 };
} T_PIN_NAME;

T_PIN_NAME pinName(char *buf, GPIO_TypeDef *port, int pin);
char portName(GPIO_TypeDef *port);
#if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)
char *gpioStr(char *buf, int size, T_PIN_NAME *pinInfo);
#endif
void gpioInfo(GPIO_TypeDef *gpio);
void tmrInfo(TIM_TypeDef *tmr);
void extiInfo();
void usartInfo(USART_TypeDef *usart, const char *str);
void i2cInfo(I2C_TypeDef *i2c, const char *str);
void spiInfo(SPI_TypeDef *spi, const char *str);
void rccInfo();
void pwrInfo();
void adcInfo(ADC_TypeDef *adc, char n);
void bkpInfo();
void afioInfo();
void rtcInfo();
#if defined(STM32F1)
void dmaInfo(DMA_TypeDef *dma);
void dmaChannelInfo(DMA_Channel_TypeDef *dmaC, char n);
#endif

void info();
void bitState(const char *s, volatile uint32_t *p, uint32_t mask);

#if defined(ARDUINO_ARCH_STM32)
char query(unsigned char (*get)(), const char *format, ...);
#endif	/* ARDUINO_ARCH_STM32 */

#endif	// ->
#ifdef __STM32INFO__

uint32_t lastFlags;

typedef struct
{
 GPIO_TypeDef *port;
 char name;
} T_GPIO, *P_GPIO;

T_GPIO gpio[] =
{
 {GPIOA, 'A'},
 {GPIOB, 'B'},
 {GPIOC, 'C'},
#ifdef GPIOD
 {GPIOD, 'D'},
#endif
#ifdef GPIOE
 {GPIOE, 'E'},
#endif
#ifdef GPIOF
 {GPIOF, 'F'},
#endif
#ifdef GPIOG
 {GPIOG, 'G'},
#endif
};

char portName(GPIO_TypeDef *port)
{
 for (unsigned int j = 0; j < sizeof(gpio) / sizeof(T_GPIO); j++)
 {
  if (port == gpio[j].port)
  {
   return(gpio[j].name);
  }
 }
 return('*');
}

T_PIN_NAME pinName(char *buf, GPIO_TypeDef *port, int pin)
{
 char pName = portName(port);
 T_PIN_NAME val;
 val.port = pName;
 int pinNum = 0;
 while (pin != 0)
 {
  if (pin & 1)
   break;
  pin >>= 1;
  pinNum++;
 }
 sprintf(buf, "P%c%d", pName, pinNum);
 val.num = pinNum;
 return(val);
}

#if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)

char modeInfo[] = {'I', 'O', 'F', 'A'};
const char *typeInfo[] = {"PP", "OD", "  "};
const char *speedInfo[] = {"LS", "MS", "HS", "VH", "  "};
const char *pupdInfo[] = {"  ", "PU", "PD", "**"};

char *gpioStr(char *buf, int size, T_PIN_NAME *pinInfo)
{
 buf[0] = 0;
 GPIO_TypeDef *port;
 for (unsigned int j = 0; j < sizeof(gpio) / sizeof(T_GPIO); j++)
 {
  if (gpio[j].name == pinInfo->port)
  {
   port = gpio[j].port;
   int pin = pinInfo->num;
//   printf("port  %08x %2d %c %2d\n", (unsigned int) port, pin,
//	  pinInfo->port, pinInfo->num);

   unsigned int mode = (port->MODER >> (pin << 1)) & 3;
//   printf("mode  %08x %d\n", (unsigned int) port->MODER, mode);

   unsigned int outType = (port->OTYPER >> pin) & 1;
//   printf("type  %08x %d\n", (unsigned int) port->OTYPER, outType);

   unsigned int outSpeed = (port->OSPEEDR >> (pin << 1)) & 3;
//   printf("speed %08x %d\n", (unsigned int) port->OSPEEDR, outSpeed);

   unsigned int pupd = (port->PUPDR >> (pin << 1)) & 3;
//   printf("pupd  %08x %d\n", (unsigned int) port->PUPDR, pupd);

   unsigned int afr = (port->AFR[pin >> 3] >> ((pin << 2) & 0x1f)) & 0xf;

   char interrupt = ' ';
   char nvic = ' ';
   if (mode == GPIO_MODE_INPUT)
   {
    outType = (sizeof(typeInfo) / sizeof(char *)) - 1;
    outSpeed = (sizeof(speedInfo) / sizeof(char *)) - 1;

    if ((EXTI->IMR1 >> pin) & 1)
    {
     unsigned int exti =
         (SYSCFG->EXTICR[pin >> 2] >> ((pin << 2) & 0xf)) & 0xf;
     if ((unsigned int) (pinInfo->port - 'A') == exti) {
      interrupt = 'I';

      if (pin <= 4) {
       if (NVIC_GetEnableIRQ((IRQn_Type) (EXTI0_IRQn + pin)))
        nvic = '*';
      } else if (pin <= 9) {
       if (NVIC_GetEnableIRQ((IRQn_Type) (EXTI9_5_IRQn)))
        nvic = '*';
      } else if (pin <= 15) {
       if (NVIC_GetEnableIRQ((IRQn_Type) (EXTI15_10_IRQn)))
        nvic = '*';
      }

//     printf("exti %2d pinInfo->port - 'A' %d pin >> 2 %d pin << 2 %d\n",
//	    exti, pinInfo->port - 'A', pin >> 2, pin << 2);
     }
    }
   }

//   printf("afr   %08x %d (pin >> 3) %d ((pin << 2) & 0x1f) %2d\n",
//	  (unsigned int) port->AFR[pin >> 3], afr,
//	  (pin >> 3), ((pin << 2) & 0x1f));
//   flushBuf();

   snprintf(buf, size, "%c%c %c %2s %2s %2s %2d",
	    interrupt, nvic, modeInfo[mode], typeInfo[outType],
	    speedInfo[outSpeed], pupdInfo[pupd], afr);
   break;
  }
 }
 return(buf);
}

#endif

void gpioInfo(GPIO_TypeDef *gpioPtr)
{
 printf("gpio %x %c\n", (unsigned int) gpioPtr, portName(gpioPtr));
//#if defined(STM32F3) || defined(STM32F4) || defined(STM32H7)
// printf("MODER   %8x ", (unsigned int) gpio->MODER);
// printf("OTYPER  %8x\n", (unsigned int) gpio->OTYPER);
// printf("OSPEEDR %8x ", (unsigned int) gpio->OSPEEDR);
// printf("PUPDR   %8x\n", (unsigned int) gpio->PUPDR);
//#endif	/* STM32F3 */
#if defined(STM32F1)
 printf("CRL     %8x ", (unsigned int) gpio->CRL);
 printf("CRH     %8x\n", (unsigned int) gpio->CRH);
#endif	/* STM32F1 */
// printf("IDR     %8x ", (unsigned int) gpio->IDR);
// printf("ODR     %8x\n", (unsigned int) gpio->ODR);
// printf("BSRR    %8x ", (unsigned int) gpio->BSRR);
// printf("LCKR    %8x\n", (unsigned int) gpio->LCKR);
//#if defined(STM32F3) || defined(STM32F4) || defined(STM32H7)
// printf("AFR[0]  %8x ", (unsigned int) gpio->AFR[0]);
// printf("AFR[1]  %8x\n", (unsigned int) gpio->AFR[1]);
//#endif	/* STM32F3 */
 int i;
 printf("         ");
 for (i = 0; i < 16; i++)
  printf(" %2d", i);

 uint32_t val;

#if defined(STM32F3) || defined(STM32F4) || defined(STM32H7)
 printf("\nmoder    ");
 val = gpioPtr->MODER;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> (2 * i)) & 0x3);

 printf("\notyper   ");
 val = gpioPtr->OTYPER;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> i) & 0x1);

