e76nystrom/USBx/project/stm32Info.c
 printf("\nopspeedr ");
 val = gpioPtr->OSPEEDR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> (2 * i)) & 0x3);

 printf("\npupdr    ");
 val = gpioPtr->PUPDR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> (2 * i)) & 0x3);
#endif	/* STM32F3 */

#if defined(STM32F1)
 printf("\n");
 printf("mode     ");
 val = gpio->CRL;
 for (i = 0; i < 8; i++)
  printf(" %2d", (int) (val >> (4 * i)) & 0x3);

 val = gpio->CRH;
 for (i = 0; i < 8; i++)
  printf(" %2d", (int) (val >> (4 * i)) & 0x3);

 printf("\n");
 printf("cnf      ");
 val = gpio->CRL;
 for (i = 0; i < 8; i++)
  printf(" %2d", (int) (val >> ((4 * i) + 2)) & 0x3);

 val = gpio->CRH;
 for (i = 0; i < 8; i++)
  printf(" %2d", (int) (val >> ((4 * i) + 2)) & 0x3);
#endif	/* STM32F1 */

 printf("\nidr      ");
 val = gpioPtr->IDR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> i) & 0x1);

 printf("\nodr      ");
 val = gpioPtr->ODR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> i) & 0x1);

 printf("\nbsrr     ");
 val = gpioPtr->BSRR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> i) & 0x1);

 printf("\nlckr     ");
 val = gpioPtr->LCKR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> i) & 0x1);

#if defined(STM32F3) || defined(STM32F4) || defined(STM32H7)
 printf("\nafr      ");
 val = gpioPtr->AFR[0];
 for (i = 0; i < 8; i++)
  printf(" %2lu", (val >> (4 * i)) & 0xf);
 val = gpioPtr->AFR[1];
 for (i = 0; i < 8; i++)
  printf(" %2lu", (val >> (4 * i)) & 0xf);
#endif	/* STM32F3 */
 printf("\n");
 flushBuf();
}

#if 0
void gpioInfo(GPIO_TypeDef *gpio)
{
 printf("gpio %x %c\n",(unsigned int) gpio, portName(gpio));
#if defined(STM32F4)
 printf("MODER   %8x ",(unsigned int) gpio->MODER);
 printf("OTYPER  %8x\n",(unsigned int) gpio->OTYPER);
 printf("OSPEEDR %8x ",(unsigned int) gpio->OSPEEDR);
 printf("PUPDR   %8x\n",(unsigned int) gpio->PUPDR);
 printf("IDR     %8x ",(unsigned int) gpio->IDR);
 printf("ODR     %8x\n",(unsigned int) gpio->ODR);
 printf("BSRR    %8x ",(unsigned int) gpio->BSRR);
 printf("LCKR    %8x\n",(unsigned int) gpio->LCKR);
 printf("AFR[0]  %8x ",(unsigned int) gpio->AFR[0]);
 printf("AFR[1]  %8x\n",(unsigned int) gpio->AFR[1]);
 int i;
 printf("         ");
 for (i = 0; i < 16; i++)
  printf(" %2d", i);

 printf("\nmoder    ");
 int val = gpio->MODER;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> (2 * i)) & 0x3);

 printf("\notyper   ");
 val = gpio->OTYPER;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\nopspeedr ");
 val = gpio->OSPEEDR;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> (2 * i)) & 0x3);

 printf("\npupdr    ");
 val = gpio->PUPDR;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> (2 * i)) & 0x3);

 printf("\nidr      ");
 val = gpio->IDR;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\nodr      ");
 val = gpio->ODR;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\nafr      ");
 val = gpio->AFR[0];
 for (i = 0; i < 8; i++)
  printf(" %2d", (val >> (4 * i)) & 0xf);
 val = gpio->AFR[1];
 for (i = 0; i < 8; i++)
  printf(" %2d", (val >> (4 * i)) & 0xf);
#endif
 printf("\n");
 flushBuf();
}
#endif	/* 0 */

typedef struct
{
 TIM_TypeDef *tmr;
 char num;
} T_TIM, *P_TIM;

T_TIM tim[] =
{
 {TIM1,  1},
 {TIM2,  2},
 {TIM3,  3},
 {TIM4,  4},
#ifdef TIM5
 {TIM5,  5},
#endif
#ifdef TIM6
 {TIM6,  6},
#endif
#ifdef TIM7
 {TIM7,  7},
#endif
#ifdef TIM8
 {TIM8,  8},
#endif
#ifdef TIM9
 {TIM9,  9},
#endif
#ifdef TIM10
 {TIM10, 10},
#endif
#ifdef TIM11
 {TIM11, 11},
#endif
#ifdef TIM12
 {TIM12, 12},
#endif
#ifdef TIM13
 {TIM13, 13},
#endif
#ifdef TIM14
 {TIM14, 14},
#endif
};

char timNum(TIM_TypeDef *tmr);

char timNum(TIM_TypeDef *tmr)
{
 for (unsigned int j = 0; j < sizeof(tim) / sizeof(T_TIM); j++)
 {
  if (tmr == tim[j].tmr)
  {
   return(tim[j].num);
  }
 }
 return(0);
}

void tmrInfo(TIM_TypeDef *tmr)
{
 printf("tmr %x TIM%d\n",(unsigned int) tmr, timNum(tmr));
 printf("CR1   %8x ",(unsigned int) tmr->CR1);
 printf("CR2   %8x\n",(unsigned int) tmr->CR2);
 printf("SMCR  %8x ",(unsigned int) tmr->SMCR);
 printf("DIER  %8x\n",(unsigned int) tmr->DIER);
 printf("SR    %8x ",(unsigned int) tmr->SR);
 printf("EGR   %8x\n",(unsigned int) tmr->EGR);
 printf("CCMR1 %8x ",(unsigned int) tmr->CCMR1);
 printf("CCMR2 %8x\n",(unsigned int) tmr->CCMR2);
 printf("CCER  %8x ",(unsigned int) tmr->CCER);
 printf("CNT   %8x\n",(unsigned int) tmr->CNT);
 printf("PSC   %8x ",(unsigned int) tmr->PSC);
 printf("ARR   %8x\n",(unsigned int) tmr->ARR);
 printf("RCR   %8x ",(unsigned int) tmr->RCR);
 printf("CCR1  %8x\n",(unsigned int) tmr->CCR1);
 printf("CCR2  %8x ",(unsigned int) tmr->CCR2);
 printf("CCR3  %8x\n",(unsigned int) tmr->CCR3);
 printf("CCR4  %8x ",(unsigned int) tmr->CCR4);
 printf("BDTR  %8x\n",(unsigned int) tmr->BDTR);
 printf("DCR   %8x ",(unsigned int) tmr->DCR);
#if defined(__STM32F4xx_HAL_H) || defined(__STM32F7xx_HAL_H)
 printf("OR    %8x\n",(unsigned int) tmr->OR);
#endif
#if defined(STM32F1) ||  defined(STM32H7)
 newline();
#endif
 flushBuf();
}

void extiBit(const char *label, uint32_t val)
{
 printf("\n%6s", label);
 for (int i = 0; i <= 22; i++)
  printf(" %2d", (int) ((val >> i) & 0x1));
}

void extiInfo(void)
{
 printf("EXTI %x\n",(unsigned int) EXTI);
 int i;
 printf("      ");
 for (i = 0; i <= 22; i++)
  printf(" %2d", i);

 printf("\n");
 printf("IMR   ");
 int val = EXTI->IMR1;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);

#if defined(STM32F4)
 printf("\n");
 printf("EMR   ");
 val = EXTI->EMR;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\n");
 printf("RTSR  ");
 val = EXTI->RTSR;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\n");
 printf("FTSR  ");
 val = EXTI->FTSR;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);
 #endif	 /* STM32F4 */

 printf("\n");
 printf("SWIER ");
 val = EXTI->SWIER1;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\n");
 printf("PR    ");
 val = EXTI->PR1;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);

#if defined(__STM32F4xx_HAL_H) || defined(__STM32F7xx_HAL_H)
 printf("\nSYSCFG %x\n",(unsigned int) SYSCFG);
 printf("      ");
 for (i = 0; i < 16; i++)
  printf(" %2d", i);

