e76nystrom/USBx/project/stm32Info.c
 printf("\nEXTICR");
 int mask = EXTI->IMR;
 for (i = 0; i < 4; i++)
 {
  val = SYSCFG->EXTICR[i];
  int j;
  for (j = 0; j < 4; j++)
  {
   printf("  %c", (mask & 1) ? 'a' + ((val >> (4 * j)) & 0xf) : ' ');
   mask >>= 1;
  }
 }
#endif

#if defined(STM32H743xx_H)
 extiBit("RTSR1", EXTI->RTSR1);
 extiBit("FTSR1", EXTI->FTSR1);
 extiBit("SWIER1", EXTI->SWIER1);
 extiBit("D3PMR1", EXTI->D3PMR1);
 extiBit("IMR1", EXTI->IMR1);
 extiBit("EMR1", EXTI->EMR1);
 extiBit("PR1", EXTI->PR1);
#endif

 printf("\n");
 flushBuf();
}

void usartInfo(USART_TypeDef *usart, const char *str)
{
 printf("usart %x %s\n",(unsigned int) usart, str);
#ifdef STM32F4
 printf("SR   %8x ",(unsigned int) usart->SR);
 printf("DR   %8x\n",(unsigned int) usart->DR);
#endif
#ifdef STM32F7
 printf("ISR  %8x ",(unsigned int) usart->ISR);
 printf("RDR  %8x\n",(unsigned int) usart->RDR);
#endif
 printf("BRR  %8x ",(unsigned int) usart->BRR);
 printf("CR1  %8x\n",(unsigned int) usart->CR1);
 printf("CR2  %8x ",(unsigned int) usart->CR2);
 printf("CR3  %8x\n",(unsigned int) usart->CR3);
 printf("GTPR %8x\n",(unsigned int) usart->GTPR);
 flushBuf();
}

#if 0
void i2cInfo(I2C_TypeDef *i2c, const char *str)
{
 printf("I2C %08x %s\n", (unsigned int) i2c, str);
 printf("CR1   %8x ", (unsigned int) i2c->CR1);
 printf("CR2   %8x\n", (unsigned int) i2c->CR2);
 printf("OAR1  %8x ", (unsigned int) i2c->OAR1);
 printf("OAR2  %8x\n", (unsigned int) i2c->OAR2);
 printf("SR1   %8x ", (unsigned int) i2c->SR1);
 printf("SR2   %8x\n", (unsigned int) i2c->SR2);
 printf("DR    %8x ", (unsigned int) i2c->DR);
 printf("CCR   %8x\n", (unsigned int) i2c->CCR);
 printf("TRISE %8x\n", (unsigned int) i2c->TRISE);
 flushBuf();
}
#endif

void i2cInfo(I2C_TypeDef *i2c, const char *str)
{
 printf("i2c %x %s\n",(unsigned int) i2c, str);
 printf("CR1      %8x ",  (unsigned int) i2c->CR1);
 printf("CR2      %8x\n", (unsigned int) i2c->CR2);
 printf("OAR1     %8x ",  (unsigned int) i2c->OAR1);
 printf("OAR2     %8x\n", (unsigned int) i2c->OAR2);
#if defined(STM32F1) || defined(STM32F3) || defined(STM32F4)
 printf("SR1      %8x ",  (unsigned int) i2c->SR1);
 printf("SR2      %8x\n", (unsigned int) i2c->SR2);
 printf("DR       %8x ",  (unsigned int) i2c->DR);
 printf("CCR      %8x\n", (unsigned int) i2c->CCR);
 printf("TRISE    %8x\n", (unsigned int) i2c->TRISE);
#endif
#ifdef STM32H7
 printf("TIMINGR  %8x ",  (unsigned int) i2c->TIMINGR);
 printf("TIMEOUTR %8x\n", (unsigned int) i2c->TIMEOUTR);
 printf("ISR      %8x ",  (unsigned int) i2c->ISR);
 printf("ICR      %8x\n", (unsigned int) i2c->ICR);
 printf("PECR     %8x\n", (unsigned int) i2c->PECR);
 printf("RXDR     %8x ",  (unsigned int) i2c->RXDR);
 printf("TXDR     %8x\n", (unsigned int) i2c->TXDR);
#endif
 flushBuf();
}

void spiInfo(SPI_TypeDef *spi, const char *str)
{
 printf("spi %x %s\n", (unsigned int) spi, str);
 printf("CR1      %8x ",  (unsigned int) spi->CR1);
 printf("CR2      %8x\n", (unsigned int) spi->CR2);
 printf("SR       %8x\n", (unsigned int) spi->SR);
}

void rccInfo(void)
{
#if defined(STM32F1)
 printf("RCC %08x\n", (unsigned int) RCC);
 printf("CR       %8x ",  (unsigned int) RCC->CR);
 printf("CFGR     %8x\n", (unsigned int) RCC->CFGR);
 printf("APB2RSTR %8x ",  (unsigned int) RCC->APB2RSTR);
 printf("APB1RSTR %8x\n", (unsigned int) RCC->APB1RSTR);
 printf("APB2ENR  %8x ",  (unsigned int) RCC->APB2ENR);
 printf("APB1ENR  %8x\n", (unsigned int) RCC->APB1ENR);
 printf("CIR      %8x ",  (unsigned int) RCC->CIR);
 printf("AHBENR   %8x\n", (unsigned int) RCC->AHBENR);
 printf("BDCR     %8x ",  (unsigned int) RCC->BDCR);
 printf("CSR      %8x\n", (unsigned int) RCC->CSR);
#endif
#ifdef STM32F4
 printf("CR         %8x ",  (unsigned int) RCC->CR);
 printf("PLLCFGR    %8x\n", (unsigned int) RCC->PLLCFGR);

 printf("CFGR       %8x ",  (unsigned int) RCC->CFGR);
 printf("CIR        %8x\n", (unsigned int) RCC->CIR);

 printf("AHB1RSTR   %8x ",  (unsigned int) RCC->AHB1RSTR);
 printf("AHB2RSTR   %8x ",  (unsigned int) RCC->AHB2RSTR);
 printf("AHB3RSTR   %8x\n", (unsigned int) RCC->AHB3RSTR);

 printf("APB1RSTR   %8x ",  (unsigned int) RCC->APB1RSTR);
 printf("APB2RSTR   %8x\n", (unsigned int) RCC->APB2RSTR);

 printf("AHB1ENR    %8x ",  (unsigned int) RCC->AHB1RSTR);
 printf("AHB2ENR    %8x ",  (unsigned int) RCC->AHB1RSTR);
 printf("AHB3ENR    %8x\n", (unsigned int) RCC->AHB1RSTR);

 printf("APB1ENR    %8x ",  (unsigned int) RCC->APB1ENR);
 printf("APB2ENR    %8x\n", (unsigned int) RCC->APB2ENR);

 printf("AHB1LPENR  %8x ",  (unsigned int) RCC->AHB1LPENR);
 printf("AHB2LPENR  %8x ",  (unsigned int) RCC->AHB2LPENR);
 printf("AHB3LPENR  %8x\n", (unsigned int) RCC->AHB3LPENR);

 printf("APB1LPENR  %8x ",  (unsigned int) RCC->APB1LPENR);
 printf("APB2LPENR  %8x\n", (unsigned int) RCC->APB2LPENR);

 printf("BDCR       %8x ",  (unsigned int) RCC->BDCR);
 printf("CSR        %8x\n", (unsigned int) RCC->CSR);

 printf("SSCGR      %8x ",  (unsigned int) RCC->BDCR);
 printf("PLLI2SCFGR %8x\n", (unsigned int) RCC->CSR);
#endif
#ifdef STM32H7
 printf("CR         %8x ",  (unsigned int) RCC->CR);
 printf("HSICFGR    %8x\n", (unsigned int) RCC->HSICFGR);

 printf("CRRCR      %8x ",  (unsigned int) RCC->CRRCR);
 printf("CSICFGR    %8x ",  (unsigned int) RCC->CSICFGR);
 printf("CFGR       %8x\n", (unsigned int) RCC->CFGR);

 printf("D1CFGR     %8x ",  (unsigned int) RCC->D1CFGR);
 printf("D2CFGR     %8x ",  (unsigned int) RCC->D2CFGR);
 printf("D3CFGR     %8x\n", (unsigned int) RCC->D3CFGR);

 printf("PLLCKSELR  %8x ",  (unsigned int) RCC->PLLCKSELR);
 printf("PLLCFGR    %8x\n", (unsigned int) RCC->PLLCFGR);

 printf("PLL1DIVR   %8x ",  (unsigned int) RCC->PLL1DIVR);
 printf("PLL1FRACR  %8x\n", (unsigned int) RCC->PLL1FRACR);

 printf("PLL2DIVR   %8x ",  (unsigned int) RCC->PLL2DIVR);
 printf("PLL2FRACR  %8x\n", (unsigned int) RCC->PLL2FRACR);

 printf("PLL3DIVR   %8x ",  (unsigned int) RCC->PLL3DIVR);
 printf("PLL3FRACR  %8x\n", (unsigned int) RCC->PLL3FRACR);

 printf("D1CCIPR    %8x ",  (unsigned int) RCC->D1CCIPR);
 printf("D2CCIP1R   %8x ",  (unsigned int) RCC->D2CCIP1R);
 printf("D2CCIP2R   %8x ",  (unsigned int) RCC->D2CCIP2R);
 printf("D3CCIPR    %8x\n", (unsigned int) RCC->D3CCIPR);

