e76nystrom/USBx/project/stm32Info.c
 printf("CIER       %8x ",  (unsigned int) RCC->CIER);
 printf("CIFR       %8x\n", (unsigned int) RCC->CIFR);

 printf("CICR       %8x ",  (unsigned int) RCC->CICR);
 printf("BDCR       %8x ",  (unsigned int) RCC->BDCR);
 printf("CSR        %8x\n", (unsigned int) RCC->CSR);

 printf("AHB3RSTR   %8x ",  (unsigned int) RCC->AHB3RSTR);
 printf("AHB1RSTR   %8x ",  (unsigned int) RCC->AHB1RSTR);
 printf("AHB2RSTR   %8x\n", (unsigned int) RCC->AHB2RSTR);
 printf("AHB4RSTR   %8x ",  (unsigned int) RCC->AHB4RSTR);
 printf("APB3RSTR   %8x\n", (unsigned int) RCC->APB3RSTR);

 printf("APB1LRSTR  %8x ",  (unsigned int) RCC->APB1LRSTR);
 printf("APB1HRSTR  %8x ",  (unsigned int) RCC->APB1HRSTR);
 printf("APB2RSTR   %8x ",  (unsigned int) RCC->APB2RSTR);
 printf("APB4RSTR   %8x\n", (unsigned int) RCC->APB4RSTR);

 printf("GCR        %8x ",  (unsigned int) RCC->GCR);
 printf("D3AMR      %8x ",  (unsigned int) RCC->D3AMR);
 printf("RSR        %8x\n", (unsigned int) RCC->RSR);

 printf("AHB3ENR    %8x ",  (unsigned int) RCC->AHB3ENR);
 printf("AHB1ENR    %8x ",  (unsigned int) RCC->AHB1ENR);
 printf("AHB2ENR    %8x ",  (unsigned int) RCC->AHB2ENR);
 printf("AHB4ENR    %8x\n", (unsigned int) RCC->AHB4ENR);

 printf("APB3ENR    %8x ",  (unsigned int) RCC->APB3ENR);
 printf("APB1LENR   %8x ",  (unsigned int) RCC->APB1LENR);
 printf("APB1HENR   %8x\n", (unsigned int) RCC->APB1HENR);
 printf("APB2ENR    %8x ",  (unsigned int) RCC->APB2ENR);
 printf("APB4ENR    %8x\n", (unsigned int) RCC->APB4ENR);

 printf("AHB3LPENR  %8x ",  (unsigned int) RCC->AHB3LPENR);
 printf("AHB1LPENR  %8x ",  (unsigned int) RCC->AHB1LPENR);
 printf("AHB2LPENR  %8x ",  (unsigned int) RCC->AHB2LPENR);
 printf("AHB4LPENR  %8x ",  (unsigned int) RCC->AHB4LPENR);

 printf("APB3LPENR  %8x ",  (unsigned int) RCC->APB3LPENR);
 printf("APB1LLPENR %8x ",  (unsigned int) RCC->APB1LLPENR);
 printf("APB1HLPENR %8x\n", (unsigned int) RCC->APB1HLPENR);
 printf("APB2LPENR  %8x ",  (unsigned int) RCC->APB2LPENR);
 printf("APB4LPENR  %8x\n", (unsigned int) RCC->APB4LPENR);
 #endif
}

#if 0
void rccInfo()
{
 printf("RCC %08x\n", (unsigned int) RCC);
 printf("CR       %8x ",  (unsigned int) RCC->CR);
 printf("CFGR     %8x\n", (unsigned int) RCC->CFGR);
 printf("APB2RSTR %8x ",  (unsigned int) RCC->APB2RSTR);
 printf("APB1RSTR %8x\n", (unsigned int) RCC->APB1RSTR);
 printf("APB2ENR  %8x ",  (unsigned int) RCC->APB2ENR);
 printf("APB1ENR  %8x\n", (unsigned int) RCC->APB1ENR);
 printf("CIR      %8x ",  (unsigned int) RCC->CIR);
 printf("AHBENR   %8x\n", (unsigned int) RCC->AHBENR);
 printf("BDCR     %8x ",  (unsigned int) RCC->BDCR);
 printf("CSR      %8x\n", (unsigned int) RCC->CSR);
}
#endif

void adcInfo(ADC_TypeDef *adc, char n)
{
 printf("ADC%d %08x  DR %08x\n",
	n, (unsigned int) adc, (unsigned int) &adc->DR);
#if defined(STM32F1)
 printf("SR    %8x\n", (unsigned int) adc->SR);
 printf("CR1   %8x ", (unsigned int) adc->CR1);
 printf("CR2   %8x\n", (unsigned int) adc->CR2);
 printf("HTR   %8x ", (unsigned int) adc->HTR);
 printf("LTR   %8x\n", (unsigned int) adc->LTR);
 printf("L     %8x ", (unsigned int) ((adc->SQR1 >> 20) & 0xf));
 printf("DR    %8x\n", (unsigned int) adc->DR);
 int i;
 printf("     ");
 for (i = 0; i < 16; i++)
  printf(" %2d", i);
 printf("\n");

 printf("SMPR ");
 int32_t tmp = adc->SMPR2;
 for (i = 0; i < 10; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 3;
 }
 tmp = adc->SMPR1;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 3;
 }
 printf("\n");

 printf("SQR  ");
 tmp = adc->SQR3;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 5;
 }
 tmp = adc->SQR2;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 5;
 }
 tmp = adc->SQR1;
 for (i = 0; i < 4; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 5;
 }
 printf("\n");
#endif	/* STM32F1 */
#if defined(STM32F3)
 printf("ISR   %8x ", (unsigned int) adc->ISR);
 printf("IER   %8x\n", (unsigned int) adc->IER);
 printf("CR    %8x ", (unsigned int) adc->CR);
 printf("CFGR  %8x\n", (unsigned int) adc->CFGR);
 printf("CAL   %8x ", (unsigned int) adc->CALFACT);
 printf("DR    %8x\n", (unsigned int) adc->DR);
 int i;
 printf("     ");
 for (i = 0; i < 16; i++)
  printf(" %2d", i);
 printf("\n");

 printf("SMPR ");
 int32_t tmp = adc->SMPR1;
 for (i = 0; i < 10; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 3;
 }
 tmp = adc->SMPR2;
 for (i = 0; i < 9; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 3;
 }
 printf("\n");

 printf("SQR  ");
 tmp = adc->SQR1;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 0xf));
  tmp >>= 6;
 }
 tmp = adc->SQR2;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 0x4));
  tmp >>= 6;
 }
 tmp = adc->SQR3;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 0xf));
  tmp >>= 6;
 }
 tmp = adc->SQR4;
 for (i = 0; i < 2; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 0xf));
  tmp >>= 6;
 }
 printf("\n");
#endif	/* STM32F3 */
 flushBuf();
}

#if defined(SMT32F1)
void dmaInfo(DMA_TypeDef *dma)
{
 printf("DMA1 %08x\n", (unsigned int) dma);
 printf("ISR   %8x ", (unsigned int) dma->ISR);
 printf("IFCR  %8x\n", (unsigned int) dma->IFCR);
 flushBuf();
}
#endif

#if defined(STM32F1)
void dmaChannelInfo(DMA_Channel_TypeDef *dmaC, char n)
{
 printf("DMA_Channel%d %08x\n", n, (unsigned int) dmaC);
 printf("CCR   %8x ", (unsigned int) dmaC->CCR);
 printf("CNDTR %8x\n", (unsigned int) dmaC->CNDTR);
 printf("CPAR  %8x ", (unsigned int) dmaC->CPAR);
 printf("CMAR  %8x\n", (unsigned int) dmaC->CMAR);
 flushBuf();
}
#endif

void afioInfo(void)
{
#if defined(STM32F1)
 printf("AFIO %x\n", (unsigned int) AFIO);
 printf("EVCR      %8x ",  (unsigned int) AFIO->EVCR);
 printf("MAPR      %8x\n", (unsigned int) AFIO->MAPR);
 printf("EXTICR[0] %8x ",  (unsigned int) AFIO->EXTICR[0]);
 printf("EXTICR[1] %8x\n", (unsigned int) AFIO->EXTICR[1]);
 printf("EXTICR[2] %8x ",  (unsigned int) AFIO->EXTICR[2]);
 printf("EXTICR[3] %8x\n", (unsigned int) AFIO->EXTICR[3]);
 printf("MAPR2     %8x\n", (unsigned int) AFIO->MAPR2);
#endif
}

void bkpInfo(void)
{
#if defined(STM32F1)
 printf("BKP %x\n", (unsigned int) BKP);
 printf("RTCCR     %8x ",  (unsigned int) BKP->RTCCR);
 printf("CR        %8x\n", (unsigned int) BKP->CR);
 printf("CSR       %8x\n", (unsigned int) BKP->CSR);
#endif
}

void rtcInfo(void)
{
#if defined(STM32F1)
 printf("RTC %x\n", (unsigned int) RTC);
 printf("CRH       %8x ",  (unsigned int) RTC->CRH);
 printf("CRL       %8x\n", (unsigned int) RTC->CRL);
 printf("PRLH      %8x ",  (unsigned int) RTC->PRLH);
 printf("PRLL      %8x\n", (unsigned int) RTC->PRLL);
 printf("DIVH      %8x ",  (unsigned int) RTC->DIVH);
 printf("DIVL      %8x\n", (unsigned int) RTC->DIVL);
 printf("CNTH      %8x ",  (unsigned int) RTC->CNTH);
 printf("CNTL      %8x\n", (unsigned int) RTC->CNTL);
 printf("ALRH      %8x ",  (unsigned int) RTC->ALRH);
 printf("ALRL      %8x\n", (unsigned int) RTC->ALRL);
#endif
}

void pwrInfo(void)
{
 printf("PWR %x\n", (unsigned int) PWR);
#if defined(STM32F1) || defined(STM32F4)
 printf("CR        %8x ",  (unsigned int) PWR->CR);
 printf("CSR       %8x\n", (unsigned int) PWR->CSR);
#endif /* STM32F1 || STM32F4 */
#if defined(STM32H7)
 printf("CR1        %8x ",  (unsigned int) PWR->CR1);
 printf("CSR1       %8x\n", (unsigned int) PWR->CSR1);
 printf("CR2        %8x ",  (unsigned int) PWR->CR2);
 printf("CR3        %8x\n", (unsigned int) PWR->CR3);
 printf("CPUCR2     %8x ",  (unsigned int) PWR->CPUCR);
 printf("D3CR       %8x\n", (unsigned int) PWR->D3CR);
 printf("WKUPCR     %8x ",  (unsigned int) PWR->WKUPCR);
 printf("WKUPFR     %8x\n", (unsigned int) PWR->WKUPFR);
 printf("WKUPEPR    %8x\n", (unsigned int) PWR->WKUPEPR);
#endif /* STM32F7 */
}

#if defined(ARDUINO_ARCH_STM32)

extern unsigned char getNum();
extern int val;

char query(unsigned char (*get)(), const char *format, ...)
{
 va_list args;
 va_start(args, format);
 vprintf(format, args);
 va_end(args);
 flushBuf();
 char ch = get();
 newLine();
 return(ch);
}

#endif	/* ARDUINO_ARCH_STM32 */

