e76nystrom/USBx/project/stm32Info.c
#if defined(INFO)
void info()
{
#if defined(ARDUINO_ARCH_STM32)
 if (query(&getNum, " flag [0x%x]: ", lastFlags) == 0)
 {
  val = (int) lastFlags;
 }
 else
 {
  lastFlags = val;
 }
#else
 int val;
 if (query(&getNum, &val, " flag [0x%x]: ", lastFlags) == 0)
 {
  val = (int) lastFlags;
 }
 else
 {
  lastFlags = val;
 }
#endif
 newline();
 flushBuf();
 if (val & 0x01)
  tmrInfo(TIM1);
#ifdef TIM2
 if (val & 0x02)
  tmrInfo(TIM2);
#endif
#ifdef TIM3
 if (val & 0x04)
  tmrInfo(TIM3);
#endif
#ifdef TIM4
 if (val & 0x08)
  tmrInfo(TIM4);
#endif
#ifdef TIM5
 if (val & 0x10)
  tmrInfo(TIM5);
#endif

 if (val & 0x20)
 {
#ifdef TIM6
  tmrInfo(TIM6);
#endif
#ifdef TIM7
  tmrInfo(TIM7);
#endif
 }

#ifdef TIM8
 if (val & 0x40)
  tmrInfo(TIM8);
#endif

 if (val & 0x80)
 {
#ifdef TIM9
  tmrInfo(TIM9);
#endif
#ifdef TIM15
  tmrInfo(TIM15);
#endif
 }

 if (val & 0x100)
 {
#ifdef TIM10
  tmrInfo(TIM10);
#endif
#ifdef TIM16
  tmrInfo(TIM16);
#endif
 }

 if (val & 0x200)
 {
#ifdef TIM11
  tmrInfo(TIM11);
#endif
#ifdef TIM17
  tmrInfo(TIM17);
#endif
 }

#ifdef TIM12
 if (val & 0x400)
  tmrInfo(TIM12);
#endif

 if (val & 0x800)		/* exti */
  extiInfo();

 if (val & 0x01000)
  gpioInfo(GPIOA);
 if (val & 0x02000)
  gpioInfo(GPIOB);
 if (val & 0x04000)
  gpioInfo(GPIOC);
#ifdef GPIOD
 if (val & 0x08000)
  gpioInfo(GPIOD);
#endif
#ifdef GPIOE
 if (val & 0x10000)
  gpioInfo(GPIOE);
#endif
#ifdef GPIOF
 if (val & 0x20000)
  gpioInfo(GPIOF);
#endif
#ifdef GPIOG
 if (val & 0x40000)
  gpioInfo(GPIOH);
#endif

#if defined(STM32MON)
 if (val & 0x100000)
  usartInfo(USART1, "DBG");
 if (val & 0x200000)
  usartInfo(USART3, "WIFI");
#else
 if (val & 0x100000)
 {
  usartInfo(DBGPORT, "DBG");
  usartInfo(REMPORT, "REM");
#if defined(MEGAPORT)
  usartInfo(DBGPORT, "MEGA");
#endif	/* MEGAPORT */
 }
#endif	/* STM32MON */

 if (val & 0x400000)
 {
#if defined(STM32MON)
  i2cInfo(I2C1, "I2C1");
#else
#ifdef I2C1
  i2cInfo(I2C_DEV, I2C_NAME);
#endif
#if defined(SPI3)
  spiInfo(SPIn, SPI_NAME);
#endif  /* SPI3 */
#endif  // STM32MON
 }

 if (val & 0x800000)
 {
  adcInfo(ADC1, '1');
  newline();
  adcInfo(ADC2, '2');
 }
 if (val & 0x1000000)
 {
  rtcInfo();
 }
 if (val & 0x2000000)
 {
  pwrInfo();
  newline();
  bkpInfo();
  newline();
  afioInfo();
 }
}
#endif  /* INFO */

void bitState(const char *s, volatile uint32_t *p, uint32_t mask)
{
 printf("%s %c\n", s, ((*p & mask) == 0) ? '0' : '1');
}

#endif	/* __STM32INFO */
